#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.votive_svc["storage"].github_branch.branch["develop"] will be created
  + resource "github_branch" "branch" {
      + branch        = "develop"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "votive-svc-storage"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # module.votive_svc["storage"].github_branch_default.default will be created
  + resource "github_branch_default" "default" {
      + branch     = "develop"
      + id         = (known after apply)
      + repository = "votive-svc-storage"
    }

  # module.votive_svc["storage"].github_branch_protection.all["votive-svc-storage"] will be created
  + resource "github_branch_protection" "all" {
      + allows_deletions                = true
      + allows_force_pushes             = true
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "*"
      + repository_id                   = "votive-svc-storage"
      + require_conversation_resolution = false
      + require_signed_commits          = true
      + required_linear_history         = false
    }

  # module.votive_svc["storage"].github_branch_protection.protection["develop"] will be created
  + resource "github_branch_protection" "protection" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + pattern                         = "develop"
      + repository_id                   = "votive-svc-storage"
      + require_conversation_resolution = true
      + require_signed_commits          = true
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + pull_request_bypassers          = [
              + "MDM6QXBwOTU3OA==",
            ]
          + require_code_owner_reviews      = true
          + required_approving_review_count = 1
          + restrict_dismissals             = true
        }

      + required_status_checks {
          + strict = true
        }
    }

  # module.votive_svc["storage"].github_branch_protection.protection["main"] will be created
  + resource "github_branch_protection" "protection" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + pattern                         = "main"
      + repository_id                   = "votive-svc-storage"
      + require_conversation_resolution = true
      + require_signed_commits          = true
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + pull_request_bypassers          = [
              + "MDM6QXBwOTU3OA==",
            ]
          + require_code_owner_reviews      = true
          + required_approving_review_count = 1
          + restrict_dismissals             = true
        }

      + required_status_checks {
          + strict = true
        }
    }

  # module.votive_svc["storage"].github_repository.repository will be created
  + resource "github_repository" "repository" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "Microservice for the Votive Dictionary Management System"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + has_projects                = true
      + has_wiki                    = true
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + is_template                 = false
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "votive-svc-storage"
      + node_id                     = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + visibility                  = "public"
      + vulnerability_alerts        = true
    }

  # module.votive_svc["storage"].github_repository_file.files[".cargo-husky/hooks/README.md"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Eldencat Automation"
      + commit_email        = "automation@eldencat.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            DO NOT EDIT! This file was provisioned by Terraform
            
            These hooks will be copied to `.git/hooks/` when `cargo test` is run.
            
            :exclamation: If editing these hooks, you will need to delete the `target/`
            directory and re-run `cargo test`.
        EOT
      + file                = ".cargo-husky/hooks/README.md"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "votive-svc-storage"
      + sha                 = (known after apply)
    }

  # module.votive_svc["storage"].github_repository_file.files[".cargo-husky/hooks/pre-commit"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Eldencat Automation"
      + commit_email        = "automation@eldencat.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            #!/bin/sh
            #
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            ##
            #
            # This hook was set by cargo-husky v1.5.0: https://github.com/rhysd/cargo-husky#readme
            
            # Style templates for console output.
            GREEN=$(tput setaf 2)
            YELLOW=$(tput setaf 3)
            NC=$(tput setaf 9)
            BOLD=$(tput bold)
            SGR0=$(tput sgr0)
            
            echo -e "${BOLD}${YELLOW}Running the pre-commit hook...${NC}${SGR0}"
            
            set -e
            
            # RUST
            make rust-test
            
            # PYTHON 3
            make python-test
            
            # TOML formatting
            make toml-test
            
            # Style Check
            make editorconfig-test
            
            # Spell Check
            make cspell-test
            
            # Finish
            echo "${BOLD}${GREEN}🍺 You are good to go!${NC}${SGR0}"
        EOT
      + file                = ".cargo-husky/hooks/pre-commit"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "votive-svc-storage"
      + sha                 = (known after apply)
    }

  # module.votive_svc["storage"].github_repository_file.files[".cargo-husky/hooks/pre-push"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Eldencat Automation"
      + commit_email        = "automation@eldencat.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            #!/bin/sh
            #
            ### DO NOT EDIT!
            # This file was provisioned by Terraform
            #
            # Do nothing
        EOT
      + file                = ".cargo-husky/hooks/pre-push"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "votive-svc-storage"
      + sha                 = (known after apply)
    }

  # module.votive_svc["storage"].github_repository_file.files[".cargo/config.toml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Eldencat Automation"
      + commit_email        = "automation@eldencat.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            # DO NOT EDIT
            # This file was provisioned by Terraform
            
            # https://doc.rust-lang.org/cargo/reference/config.html
            
            [build]
            rustflags = [
              "-Wmissing_docs",
              "-Wmissing_debug_implementations",
              "-Wmissing_copy_implementations",
              "-Wtrivial_casts",
              "-Wtrivial_numeric_casts",
              "-Wunsafe_code",
              "-Wunstable_features",
              "-Wunused_import_braces",
              "-Wunused_qualifications",
            ]
        EOT
      + file                = ".cargo/config.toml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "votive-svc-storage"
      + sha                 = (known after apply)
    }

  # module.votive_svc["storage"].github_repository_file.files[".cspell.config.yaml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Eldencat Automation"
      + commit_email        = "automation@eldencat.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ---
            # DO NOT EDIT - This file was provisioned by Terraform
            # 
            $schema: https://raw.githubusercontent.com/streetsidesoftware/cspell/main/cspell.schema.json
            version: '0.2'
            language: "en"
            dictionaryDefinitions:
              - name: project-words
                path: './.cspell.project-words.txt'
                addWords: true
            dictionaries: ["project-words"]
            ignorePaths:
              - './.cspell.project-words.txt'
              - '**/vscode-extension/**'
              - '**/.git/**'
              - '**/target/**'
              - '.vscode'
              - '.taplo.toml'
        EOT
      + file                = ".cspell.config.yaml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "votive-svc-storage"
      + sha                 = (known after apply)
    }

  # module.votive_svc["storage"].github_repository_file.files[".cspell.project-words.txt"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Eldencat Automation"
      + commit_email        = "automation@eldencat.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            votive-svc-storage
            clippy
            rustc
            rustup
            taplo
            chrono
            serde
            proto
            grpc
            tamasfe
        EOT
      + file                = ".cspell.project-words.txt"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + repository          = "votive-svc-storage"
      + sha                 = (known after apply)
    }

  # module.votive_svc["storage"].github_repository_file.files[".editorconfig"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Eldencat Automation"
      + commit_email        = "automation@eldencat.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            
            # EditorConfig helps developers define and maintain consistent
            # coding styles between different editors and IDEs
            # editorconfig.org
            root = true
            [*]
            end_of_line = lf
            charset = utf-8
            trim_trailing_whitespace = true
            insert_final_newline = true
            indent_style = space
            indent_size = 4
            [*.md]
            # double whitespace at end of line
            # denotes a line break in Markdown
            indent_size = off
            trim_trailing_whitespace = false
            [{*.yml,*.yaml,*.toml}]
            indent_size = 2
            [Makefile*]
            indent_style = tab
            indent_size = 4
            
        EOT
      + file                = ".editorconfig"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "votive-svc-storage"
      + sha                 = (known after apply)
    }

  # module.votive_svc["storage"].github_repository_file.files[".github/workflows/rust_ci.yml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Eldencat Automation"
      + commit_email        = "automation@eldencat.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # Check file validity at: https://rhysd.github.io/actionlint/
            # https://github.com/actions/virtual-environments/blob/main/images/linux/Ubuntu2004-Readme.md
            
            on:
              push:
                branches:
                - main
                - develop
              pull_request:
            
            name: Rust Checks
            
            env:
              TERM: xterm
            
            jobs:
              check:
                name: Checks
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                  - run: make rust-check
            
              build_and_test_debug:
                name: Build & Test
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                  - name: Build
                    run: make build
                  - name: Test
                    run: make rust-test
                  # Coming soon: grcov + push results to website or service (coveralls, etc.)
            
              fmt:
                name: Rustfmt
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                  - run: make rust-fmt
            
              clippy:
                name: Clippy
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                  - run: make rust-clippy
        EOT
      + file                = ".github/workflows/rust_ci.yml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "votive-svc-storage"
      + sha                 = (known after apply)
    }

  # module.votive_svc["storage"].github_repository_file.files[".github/workflows/sanity_checks.yml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Eldencat Automation"
      + commit_email        = "automation@eldencat.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            
            name: Sanity checks
            
            env:
              TERM: xterm
            
            on:
              push:
                branches:
                  - main
                  - develop
              pull_request:
            
            jobs:
              codestyle:
                name: Code Style check
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                  - run: make editorconfig-test
            
              toml:
                name: TOML format check
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                  - run: make toml-test
            
              cspell:
                name: Spelling check
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                  - run: make cspell-test
        EOT
      + file                = ".github/workflows/sanity_checks.yml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "votive-svc-storage"
      + sha                 = (known after apply)
    }

  # module.votive_svc["storage"].github_repository_file.files[".gitignore"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Eldencat Automation"
      + commit_email        = "automation@eldencat.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            
            # Generated by Cargo
            # will have compiled files and executables
            debug/
            target/
            # Local cargo cache generated by make targets
            .cargo/registry
            
            # Remove Cargo.lock from gitignore if creating an executable, leave it for libraries
            # More information here https://doc.rust-lang.org/cargo/guide/cargo-toml-vs-cargo-lock.html
            
            
            
            client/Cargo.lock
            
            
            # These are backup files generated by rustfmt
            **/*.rs.bk
            
            # MSVC Windows builds of rustc generate these, which store debugging information
            *.pdb
            
            # Don't add vscode meta files
            .vscode
        EOT
      + file                = ".gitignore"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "votive-svc-storage"
      + sha                 = (known after apply)
    }

  # module.votive_svc["storage"].github_repository_file.files[".taplo.toml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Eldencat Automation"
      + commit_email        = "automation@eldencat.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            exclude = ["**/.cargo/registry/**"]
            
            [formatting]
            reorder_keys  = false
            align_entries = true
            
            [[rule]]
            include = ["**/Cargo.toml"]
            keys = [
              "dependencies",
              "dev-dependencies",
              "build-dependencies",
              "target",
              "package",
              "workspace",
              "profile",
              "replace",
              "patch",
              "features",
              "badges",
            ]
            
            [rule.formatting]
            reorder_keys = true
        EOT
      + file                = ".taplo.toml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "votive-svc-storage"
      + sha                 = (known after apply)
    }

  # module.votive_svc["storage"].github_repository_file.files["LICENSE"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Eldencat Automation"
      + commit_email        = "automation@eldencat.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + file                = "LICENSE"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "votive-svc-storage"
      + sha                 = (known after apply)
    }

  # module.votive_svc["storage"].github_repository_file.files["Makefile"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Eldencat Automation"
      + commit_email        = "automation@eldencat.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            SHELL := /bin/bash
            
            DOCKER_NAME      := votive-svc-storage
            IMAGE_NAME       := votive-svc-storage
            BUILD_IMAGE_NAME := ghcr.io/eldencat/devtools/votive-dev
            BUILD_IMAGE_TAG  := latest
            DOCKER_PORT      := 8080
            HOST_PORT        := 8000
            
            # We might not have a Cargo.toml file in the root dir
            CARGO_MANIFEST_PATH ?= $(shell find -maxdepth 2 -name Cargo.toml)
            CARGO_INCREMENTAL   ?= 1
            RUSTC_BOOTSTRAP     ?= 0
            RELEASE_TARGET      ?= x86_64-unknown-linux-musl
            
            # Style templates for console output.
            GREEN  := $(shell echo -e `tput setaf 2`)
            YELLOW := $(shell echo -e `tput setaf 3`)
            CYAN   := $(shell echo -e `tput setaf 6`)
            NC     := $(shell echo -e `tput setaf 9`)
            BOLD   := $(shell echo -e `tput bold`)
            SMUL   := $(shell echo -e `tput smul`)
            SGR0   := $(shell echo -e `tput sgr0`)
            
            # function with a generic template to run docker with the required values
            # Accepts $1 = command to run, $2 = additional flags (optional)
            docker_run = docker run \
            	--name=$(DOCKER_NAME)-$@ \
            	--rm \
            	--user `id -u`:`id -g` \
            	-e CARGO_INCREMENTAL=$(CARGO_INCREMENTAL) \
            	-e RUSTC_BOOTSTRAP=$(RUSTC_BOOTSTRAP) \
            	-v "$(PWD):/usr/src/app" \
            	-v "$(PWD)/.cargo/registry:/usr/local/cargo/registry" \
            	$(2) \
            	-t $(BUILD_IMAGE_NAME):$(BUILD_IMAGE_TAG) \
            	$(1)
            
            ifeq ("$(CARGO_MANIFEST_PATH)", "")
            cargo_run = echo "$(BOLD)$(YELLOW)No Cargo.toml found in any of the subdirectories, skipping cargo check...$(NC)$(SGR0)"
            else
            cargo_run = $(call docker_run,cargo $(1) --manifest-path "$(CARGO_MANIFEST_PATH)" $(2))
            endif
            
            taplo_run = docker run \
                	--name=$(DOCKER_NAME)-taplo-$@ \
            		--rm \
            		--user `id -u`:`id -g` \
            		-w "/usr/src/app" \
            		-v "$(PWD):/usr/src/app" \
                    -t tamasfe/taplo $(1)
            
            cspell_run = docker run \
            		--name=$(DOCKER_NAME)-cspell-$@ \
            		--rm \
            		--user `id -u`:`id -g` \
            		-w "/usr/src/app" \
            		-v "$(PWD):/usr/src/app" \
            		-t ghcr.io/streetsidesoftware/cspell:6.10.1 \
            		cspell $(1)
            
            help:
            	@echo ""
            	@echo "$(BOLD)$(CYAN)Available targets$(NC)$(SGR0)"
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)Rust$(NC)$(SGR0)"
            	@echo "  $(YELLOW)All cargo commands will use '--manifest-path $(CARGO_MANIFEST_PATH)'$(NC)"
            	@echo "  $(BOLD)build$(SGR0)       -- Run 'cargo build'"
            	@echo "  $(BOLD)release$(SGR0)     -- Run 'cargo build --release --target RELEASE_TARGET'"
            	@echo "                 (RELEASE_TARGET=$(RELEASE_TARGET))"
            	@echo "  $(BOLD)publish$(SGR0)     -- Run 'cargo publish --dry-run --target RELEASE_TARGET'"
            	@echo "                 (RELEASE_TARGET=$(RELEASE_TARGET))"
            	@echo "  $(BOLD)clean$(SGR0)       -- Run 'cargo clean'"
            	@echo "  $(BOLD)rust-check$(SGR0)  -- Run 'cargo check'"
            	@echo "  $(BOLD)rust-test$(SGR0)   -- Run 'cargo test --all'"
            	@echo "  $(BOLD)rust-clippy$(SGR0) -- Run 'cargo clippy --all -- -D warnings'"
            	@echo "  $(BOLD)rust-fmt$(SGR0)    -- Run 'cargo fmt --all -- --check' to check rust file formats."
            	@echo "  $(BOLD)rust-tidy$(SGR0)   -- Run 'cargo fmt --all' to fix rust file formats if needed."
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)TOML$(NC)$(SGR0)"
            	@echo "  $(BOLD)toml-test$(SGR0)   -- Run 'taplo format --check' to validate TOML file formats."
            	@echo "  $(BOLD)toml-tidy$(SGR0)   -- Run 'taplo format' to fix TOML file formats if needed."
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)CSpell$(NC)$(SGR0)"
            	@echo "  $(BOLD)cspell-test$(SGR0) -- Run 'cspell --words-only --unique "**/**" -c .cspell.config.yaml'"
            	@echo "                 to validate files are not containing any spelling errors."
            	@echo "  $(BOLD)cspell-add-words$(SGR0) -- Run 'cspell --words-only --unique "**/**" -c .cspell.config.yaml 2> /dev/null |"
            	@echo "                      sort -f >> .cspell.project-words.txt'"
            	@echo "                      to add remaining words to the project's cspell ignore list"
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)Combined targets$(NC)$(SGR0)"
            	@echo "  $(BOLD)test$(SGR0) -- Run targets; rust-check rust-test rust-clippy rust-fmt toml-test"
            	@echo "  $(BOLD)tidy$(SGR0) -- Run targets; rust-tidy toml-tidy"
            
            	@echo "  $(BOLD)run$(SGR0)  -- Run docker container as a daemon, binding port $(HOST_PORT):$(DOCKER_PORT)"
            	@echo "  $(BOLD)stop$(SGR0) -- Run 'docker kill ${DOCKER_NAME}-run && docker rm ${DOCKER_NAME}-run' to stop and cleanup our docker after running"
            	@echo "  $(BOLD)all$(SGR0)  -- Run targets; test build release run"
            
            
            # Rust / cargo targets
            check-cargo-registry:
            	if [ ! -d "$(PWD)/.cargo/registry" ]; then mkdir -p "$(PWD)/.cargo/registry" ; fi
            
            build: check-cargo-registry
            	@$(call cargo_run,build)
            
            release:
            	@$(call cargo_run,build,--release --target $(RELEASE_TARGET))
            
            publish:
            	@$(call cargo_run,publish,--dry-run --target $(RELEASE_TARGET))
            
            clean: check-cargo-registry
            	@$(call cargo_run,clean)
            
            rust-check: check-cargo-registry
            	@$(call cargo_run,check)
            
            rust-test: check-cargo-registry
            	@$(call cargo_run,test,--all)
            
            rust-clippy: check-cargo-registry
            	@$(call cargo_run,clippy,--all -- -D warnings)
            
            rust-fmt: check-cargo-registry
            	@echo "$(YELLOW)Running and checking Rust codes formats...$(NC)"
            	@$(call cargo_run,fmt,--all -- --check)
            
            rust-tidy: check-cargo-registry
            	@echo "$(YELLOW)Running rust file formatting fixes...$(NC)"
            	@$(call cargo_run,fmt,--all)
            
            # TOML / taplo targets
            toml-test:
            	@echo "$(YELLOW)Running toml file formatting tests...$(NC)"
            	@$(call taplo_run,format --check)
            
            toml-tidy:
            	@echo "$(YELLOW)Running toml file formatting fixes...$(NC)"
            	@$(call taplo_run,format)
            
            # editorconfig targets
            editorconfig-test:
            	@echo "$(YELLOW)Checking if the codebase is compliant with the .editorconfig file...$(NC)"
            	@docker run \
            		--name=$(DOCKER_NAME)-$@ \
            		--rm \
            		--user `id -u`:`id -g` \
            		-w "/usr/src/app" \
            		-v "$(PWD):/usr/src/app" \
            		-t mstruebing/editorconfig-checker
            
            # cspell targets
            cspell-test:
            	@echo "$(YELLOW)Checking for spelling errors...$(NC)"
            	@$(call cspell_run,--words-only --unique "**/**" -c .cspell.config.yaml)
            
            # Combined targets
            test: rust-check rust-test rust-clippy rust-fmt toml-test
            tidy: rust-tidy toml-tidy
            
            run: stop
            # Run docker container as a daemon and map a port
            	@$(call docker_run,sh,-d -p $(HOST_PORT):$(DOCKER_PORT))
            
            stop:
            	@docker kill ${DOCKER_NAME}-run || true
            	@docker rm ${DOCKER_NAME}-run || true
            
            all: test build release run
            
        EOT
      + file                = "Makefile"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "votive-svc-storage"
      + sha                 = (known after apply)
    }

  # module.votive_svc["storage"].github_repository_file.files["docs/conops.md"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Eldencat Automation"
      + commit_email        = "automation@eldencat.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            # Concept of Operations - `votive-svc-storage`
            
            <center>
            
            <img src="https://github.com/eldencat/terraform/raw/main/src/shared/votive-banner.png" style="height:250px" />
            
            </center>
            
            :exclamation: This document is intended for internal use.
            
            ## :running: Motivation
            
            ## :books: Documents
            
            Document | Description
            --- | ---
            :construction: Requirements & User Stories - `votive-svc-storage` :construction: | Requirements and user stories
            [Software Design Document (SDD) - `votive-svc-storage`](./sdd.md) | Module software design
            [Interface Control Document (ICD) - `votive-svc-storage`](./icd.md) | Overview of this module's inputs and outputs
            :construction: [High-Level Interface Control Document (ICD)](https://raw.githubusercontent.com/eldencat/se-votive/develop/docs/icd.md) :construction: | Interfaces shared by all microservices.
            
            ## :mag: Needs, Goals and Objectives of Envisioned System
            
            ## :telescope: Overview of System and Key Elements
            
            ## :mailbox_with_mail: External Interfaces
            These are described in the [Interface Control Document (ICD)](./icd.md).
            
            ## :carousel_horse: Proposed Capabilities
            
            ## :bike: Modes of Operation
            
            ## :station: Operational Scenarios, Use Cases and/or Design Reference Missions
            
            ## :slot_machine: Nominal & Off-Nominal Conditions
            
            ## :electric_plug: Physical Environment
            
            ## :eyes: Support Environment
            
            ## :boom: Impact Considerations
            
            ## :seedling: Environmental Impacts
            
            ## :busts_in_silhouette: Organizational Impacts
            
            ## :microscope: Technical Impacts
            
            ## :space_invader: Risks and Potential Issues
            
            ## :bookmark: Appendix A: Citations
            
            ## :bookmark_tabs: Appendix B: Acronyms & Glossary
        EOT
      + file                = "docs/conops.md"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + repository          = "votive-svc-storage"
      + sha                 = (known after apply)
    }

  # module.votive_svc["storage"].github_repository_file.files["docs/icd.md"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Eldencat Automation"
      + commit_email        = "automation@eldencat.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            # Interface Control Document (ICD) - `votive-svc-storage`
            
            <center>
            
            <img src="https://github.com/eldencat/terraform/raw/main/src/shared/votive-banner.png" style="height:250px" />
            
            </center>
            
            :exclamation: This document is intended for internal use.
            ## :telescope: Overview
            
            This document details interfaces unique to this microservice.
            
            ## :books: Related Documents
            
            Document | Description
            --- | ---
            :construction: Requirements & User Stories - `votive-svc-storage` :construction: | Requirements and user stories
            [Concept of Operations (CONOPS) - `votive-svc-storage`](./conops.md) | Module overview
            [Software Design Document (SDD) - `votive-svc-storage`](./sdd.md) | Module software design
            :construction: [High-Level Interface Control Document (ICD)](https://raw.githubusercontent.com/eldencat/se-votive/develop/docs/icd.md) :construction: | Interfaces shared by all microservices.
            
            ## :wave: Public API
            ### :file_folder: Files
            
            File locations for REST/GraphQL/gRPC files.
            
            Filename | Description
            --- | ---
            `<root>/schema/example.graphql`
            
            ### :guardsman: Authorization
            
            See the High-Level ICD.
            
            ### :mailbox_with_mail: Endpoints
            
            | Endpoint | Type | Arguments | Description |
            | ---- | --- | ---- | ---- |
            
            ## :revolving_hearts: Private API
            
            ### :file_folder: Files
            File locations for gRPC/MQTT/ZeroMQ/etc. files
            
            Filename | Description
            --- | ---
            `<root>/schema/example.proto`
            
            ### :guardsman: Authorization
            
            See the High-Level ICD.
            
            ### :mailbox_with_mail: Server Methods
            
            | Service | Description | Authorized Clients
            | ---- | ---- | ---
            | `exampleService` | Description of service | `svc-example`: Needs something
        EOT
      + file                = "docs/icd.md"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + repository          = "votive-svc-storage"
      + sha                 = (known after apply)
    }

  # module.votive_svc["storage"].github_repository_file.files["docs/sdd.md"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Eldencat Automation"
      + commit_email        = "automation@eldencat.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            # Software Design Document (SDD) - `votive-svc-storage`
            
            <center>
            
            <img src="https://github.com/eldencat/terraform/raw/main/src/shared/votive-banner.png" style="height:250px" />
            
            </center>
            
            :exclamation: This document is intended for internal use.
            
            ## :telescope: Overview
            
            This document details the software implementation of :construction:.
            
            This process is responsible for :construction:
            
            ## :books: Related Documents
            
            Document | Description
            --- | ---
            :construction: Requirements & User Stories - `votive-svc-storage` :construction: | Requirements and user stories
            [Concept of Operations (CONOPS) - `votive-svc-storage`](./conops.md) | Module overview
            [Interface Control Document (ICD) - `votive-svc-storage`](./icd.md) | Overview of this module's inputs and outputs
            :construction: [High-Level Interface Control Document (ICD)](https://raw.githubusercontent.com/eldencat/se-votive/develop/docs/icd.md) :construction: | Interfaces shared by all microservices.
            ## Module Attributes
            
            Attribute | Applies | Explanation
            --- | --- | ---
            
            ## :globe_with_meridians: Global Variables
            
            :construction:
            
            ## :robot: Logic 
            
            ### :seedling: Initialization
            
            :construction: 
            
            ### :recycle: Control Loop
            
            :construction:
            
            ### :broom: Cleanup
            
            :construction:
            
            ## :handshake: Interfaces
            
            ```mermaid
            graph LR
                subgraph Client Domain
                    app(App X)
                end
                subgraph Server Domain
                    module[Module A]
                end
            ```
            
            :construction: description of the graph.
            
            ## :heavy_check_mark: Tests
            
            :construction:
            
            ### :tulip: Unit Tests
            
            :construction:
            
            ### :bouquet: Integration Tests
            
            :construction:
        EOT
      + file                = "docs/sdd.md"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + repository          = "votive-svc-storage"
      + sha                 = (known after apply)
    }

Plan: 22 to add, 0 to change, 0 to destroy.

```

</details>

*Pusher: @ServiceDog, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*